simulate/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
vertices
(
  (-0.04799582 -0.04799872 -0.00799962)
  (0.04799962 -0.04799872 -0.00799962)
  (0.04799962 0.04799872 -0.00799962)
  (-0.04799582 0.04799872 -0.00799962)
  (-0.04799582 -0.04799872 0.30799962)
  (0.04799962 -0.04799872 0.30799962)
  (0.04799962 0.04799872 0.30799962)
  (-0.04799582 0.04799872 0.30799962)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (20 20 65) simpleGrading (1 1 1)
);
edges ();
patches ();
mergePatchPairs ();
