simulate/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
castellatedMesh true;
snap            true;
addLayers       true;
geometry
{
  model_m.stl
  {
    type triSurfaceMesh;
    name test;
    regions
    {
      thin_wall
      {
        name thin_wall;
      }
      wall3
      {
        name wall3;
      }
    }
  }
  refinementBox1
  {
      type searchableBox;
      min (-0.03 -0.03 0.05);
      max ( 0.03  0.03 0.25);
  }
  refinementBox1
  {
      type searchableBox;
      min (-0.01 -0.01 0.1);
      max ( 0.01  0.01 0.2);
  }
}
castellatedMeshControls
{
  features (
  	{
  		file "model_m.eMesh";
  		level 1;
  	}
  );
  refinementSurfaces
  {
    test
    {
      level (0 0);
      regions
      {
        thin_wall
        {
          level (1 2);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
  }
  refinementRegions
  {
    refinementBox1
    {
        mode inside;
        levels ((0 0));
    }
    refinementBox2
    {
        mode inside;
        levels ((0 0));
    }
  }
  locationInMesh (0 0 0.05);
  maxLocalCells 100000000;
  maxGlobalCells 100000000;
  minRefinementCells 1;
  nCellsBetweenLevels 9;
  resolveFeatureAngle 30;
  allowFreeStandingZoneFaces false;
}
snapControls
{
  nSolveIter 30;
  nSmoothPatch 3;
  tolerance 4.0;
  nRelaxIter 5;
  nFeatureSnapIter 10;

  //implicitFeatureSnap false;
  explicitFeatureSnap true;
  //multiRegionFeatureSnap false;
}
addLayersControls
{
  layers
  {
    wall3
    {
      nSurfaceLayers 3;
    }
  }
  relativeSizes true;
  expansionRatio 1.0;
  finalLayerThickness 0.3;
  minThickness 0.03;
  nGrow 1;
  featureAngle 60;
  nRelaxIter 5;
  nSmoothSurfaceNormals 1;
  nSmoothNormals 3;
  nSmoothThickness 10;
  maxFaceThicknessRatio 0.5;
  maxThicknessToMedialRatio 0.3;
  minMedianAxisAngle 130;
  nBufferCellsNoExtrude 0;
  nLayerIter 50;
  nRelaxedIter 20;
}
meshQualityControls
{
  maxNonOrtho 65;
  maxBoundarySkewness 20;
  maxInternalSkewness 4;
  maxConcave 80;
  minFlatness 0.5;
  minVol 1.00E-13;
  minTetQuality -1e30;
  minArea -1;
  minTwist 0.05;
  minDeterminant 0.001;
  minFaceWeight 0.05;
  minVolRatio 0.01;
  minTriangleTwist -1;
  nSmoothScale 4;
  errorReduction 0.75;
  relaxed
  {
    maxNonOrtho 180;
  }
}
debug 0;
mergeTolerance 1e-5;
