simulate/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    0;
    object      U;
}
dimensions [0 1 -1 0 0 0 0];
internalField uniform (1.0 0.0 0.0);
boundaryField
{
    zmin
    {
        type surfaceNormalFixedValue;
        refValue uniform -1.0;
    }
    wall
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    zmax
    {
        type zeroGradient;
    }
}
