simulate/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      k;
}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.001;
boundaryField
{
    zmin
    {
        type fixedValue;
        value uniform 0.001;
    }
    wall
    {
        type kqRWallFunction;
        value uniform 0.0;
    }
    zmax
    {
        type zeroGradient;
    }
}
