simulate/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      nut;
}
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0.001;
boundaryField
{
    zmin
    {
        type zeroGradient;
    }
    wall
    {
        type nutkWallFunction;
        value uniform 0.0;
    }
    zmax
    {
        type calculated;
        value uniform 0.001;
    }
}
