simulate/system/surfaceFeaturesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeaturesDict;
}
surfaces
(
    "model_m.stl"
);
includedAngle 165.0
subsetFeatures
{
    nonManifoldEdges no;
    openEdges yes;
}
writeObj yes;
